homework/Lab04/combustorRhoPimple_highT_lowRe/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default    Euler;
}

gradSchemes
{
    default    Gauss linear;
    grad(U)    cellLimited Gauss linear 1;
}

divSchemes
{
    default                                 none;
    div(phi,U)                              Gauss linearUpwind grad(U);
    div(phi,k)                              Gauss limitedLinear 1;
    div(phi,epsilon)                        Gauss limitedLinear 1;
    div(phi,omega)                          Gauss limitedLinear 1;
    div(nonlinearStress)                    Gauss linear;
    div(phi,h)                              Gauss limitedLinear 1; 
    div(phi,K)                              Gauss limitedLinear 1; 
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default    Gauss linear corrected;
}

interpolationSchemes
{
    default    linear;
}

snGradSchemes
{
    default    corrected;
}

wallDist
{
    method meshWave;
}

