homework/Lab04/combustorRhoPimple_highT_lowRe/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "(rho.*)"
    {
        solver      diagonal;
        tolerance   1e-09;
        relTol      0.0;
    }

    h
    {
        solver      smoothSolver;
        smoother    symGaussSeidel; 
        tolerance   1e-07;
        relTol      1e-01;
    }

    hFinal
    { 
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-07;
        relTol      0.0;
    }

    p
    {
        solver      GAMG;
        smoother    GaussSeidel;
        tolerance   1e-07;
        relTol      1e-01;
    }

    pFinal
    {
        solver      GAMG;
        smoother    GaussSeidel;
        tolerance   1e-07;
        relTol      0.0;
    }

    "(U|k|epsilon|omega)"
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-07;
        relTol      1e-01;
    }

    "(U|k|epsilon|omega)Final"
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-07;
        relTol      0.0;
    }
}

PIMPLE
{
    nCorrectors                 2;
    nOuterCorrectors            100;
    nNonOrthogonalCorrectors    0;
    momentumPredictor           true;
    consistent                  false;
    turbOnFinalIterOnly         false;
    
    outerCorrectorResidualControl
    {
        p
        {
            tolerance   1e-03;
            relTol      0.0;
        }

        U
        {
            tolerance   1e-04;
            relTol      0.0;
        }

        h
        {
            tolerance   1e-04;
            relTol      0.0;
        }
    }

    residualControl
    {
        p 1e-04;
        U 1e-05;
        h 1e-05; 
    }
}

relaxationFactors
{
    fields
    {
        "p.*" 0.3;
    }

    equations
    {
        "U.*"           0.7;
        "(k|epsilon).*" 0.5;
        "h.*"           0.5;
    }
}

// ******************************************************************************* // 
